# Overview

This is the note of Udemy course "The Ultimate MySQL Bootcamp: Go from SQL Beginner to Expert" by Colt Steele that I made for my personal reference. It covers the most often used basic SQL syntax and knowledge.

## Index

1. Chapter 1 : Work with Database
2. Chapter 2 : Work with Tables
3. Chapter 3 : Work with Data
4. Chapter 4 : The Basic of "CRUD" <br>
    4.1 Read Data <br>
    4.2 Update Data <br>
    4.3 Delete Data
5. Chapter 5 : Run SQL Files
6. Chapter 6 : The String Functions
7. Chapter 7 : Refining Selection
8. Chpater 8 : The Aggregate Functions
9. Chapter 9 : More into Data Types
10. Chapter 10 : Logical Operators
11. Chapter 11 : Work with Multiple Tables – One To Many
12. Chapter 12 : Work with Multiple Tables – Many To Many

## Note

1. I'm using Goorm.io as my workspace/IDE.

2. All the SQL functions/syntax/statement in the document are written in **ALL CAPS** with '**-**' sign at front, and <br> all the variables are written between the '`<`' & '`>`' sign (*e.g.* `<veriable_name>`).

# Chapter 1 : Work with Database
Let's **start the SQL commend line interface** by using **`mysql-ctl cli`** commend on the terminal.

### - SHOW DATABASES

use `SHOW DATABASES;` to show all the existing database in the server

### - CREATE DATABASE

use `CREATE DATABASE <name>;` to create a new database

### - DROP DATABASE
**WARNING**: Be extremely careful when using commend!

use `DROP DATABASE <name>;` to **delete** the whole database

### - USE

use `USE <database_name>;` to run a database

### - SELECT database()
use `SELECT database();` to check what database are we currently using.

<br><br>

#  Chapter 2 : Work with Tables
There is a bunch of tables in a database. This is where the data is store.

### Data Types
In SQL, there is a bunch of data types, and must be specified when you create the columns (or header)

   **Numeric Type**
    - INT (e.g. 12, 0, -999, 31415926, )
    - DECIMAL

   **Text Type**
    - VARCHAR(1-255) - a variable-length string (e.g. 'dog', 'asdfhsufhoad', '9', 'Hello World!')
 
   **Date Type**
    - DATETIME
    - TIMESTAMP

**Example** - A tweet table

 1. User Name: `userName - VARCHAR(15)`
 2. Tweet Content: `tweetContent - VARCHAR(140)`
 3. Number of favorites: `likes - INT`

### - Create Table
In convention, we use **plural** to name the table. <br>

Use the following syntax to create a table: <br>
> `CREATE TABLE <table_name> 
    (
        <column_name>   <DATA_TYPE>,
        <column_name>   <DATA_TYPE>
    );`

*e.g.*

**Create a *books* table**
> `CREATE TABLE books 
	(
		book_id INT NOT NULL AUTO_INCREMENT,
		title VARCHAR(100),
		author_fname VARCHAR(100),
		author_lname VARCHAR(100),
		released_year INT,
		stock_quantity INT,
		pages INT,
		PRIMARY KEY(book_id)
	);`

Create a *tweets* table
> `CREATE TABLE tweets 
    (
        userName       VARCHAR(15),
        tweetContent   VARCHAR(140),
        likes          INT
    );`

### - SHOW TABLES
use `SHOW TABLES;`to check all tables in the database

### - DESC
use `SHOW COLUMNS FROM <Table_Name>;` or `DESC <Table_Name>;` to get the schema (all columns and data types) of the table.<br>
*The result is identical.*

### - DROP TABLE
use `DROP TABLE <Table_Name>;` to delete the entire table

<br><br>

# Chapter 3 : Work with Data

### - INSERT INTO

use the following syntax to insert a line of data into a table:
>` INSERT INTO <table_name> (<column_name_1>, <column_name_2>, ...)
 VALUES (<value_1>, <value_2>, ...);`

and, when inserting multiple data:
>` INSERT INTO <table_name> (<column_name_1>, <column_name_2>, ...)
 VALUES (<value_1>, <value_2>, ...),
       (<value_1>, <value_2>, ...),
       (<value_1>, <value_2>, ...);`

*e.g.*

**Insert some data in the *books* table:**
> `INSERT INTO books (title, author_fname, author_lname, released_year, stock_quantity, pages)
VALUES
('The Namesake', 'Jhumpa', 'Lahiri', 2003, 32, 291),
('Norse Mythology', 'Neil', 'Gaiman',2016, 43, 304),
('American Gods', 'Neil', 'Gaiman', 2001, 12, 465),
('Interpreter of Maladies', 'Jhumpa', 'Lahiri', 1996, 97, 198),
('A Hologram for the King: A Novel', 'Dave', 'Eggers', 2012, 154, 352),
('The Circle', 'Dave', 'Eggers', 2013, 26, 504),
('The Amazing Adventures of Kavalier & Clay', 'Michael', 'Chabon', 2000, 68, 634),
('Just Kids', 'Patti', 'Smith', 2010, 55, 304),
('A Heartbreaking Work of Staggering Genius', 'Dave', 'Eggers', 2001, 104, 437),
('Coraline', 'Neil', 'Gaiman', 2003, 100, 208),
('What We Talk About When We Talk About Love: Stories', 'Raymond', 'Carver', 1981, 23, 176),
("Where I'm Calling From: Selected Stories", 'Raymond', 'Carver', 1989, 12, 526),
('White Noise', 'Don', 'DeLillo', 1985, 49, 320),
('Cannery Row', 'John', 'Steinbeck', 1945, 95, 181),
('Oblivion: Stories', 'David', 'Foster Wallace', 2004, 172, 329),
('Consider the Lobster', 'David', 'Foster Wallace', 2005, 92, 343);`

Note: **ORDER MATTERS!**

### - SHOW WARNINGS

When there's a problem while inserting data (e.g. string is too long, wrong data type), it will tell you there's a warning. <br>
To check what the problem was, use `SHOW WARNINGS;` after you're warned.<br><br>
Note that it only works on the previous commend. <br>
For instance, if you use `SELECT` immediately after inserting data. `SHOW WARNINGS;` will show *empty*.

### - Null
Unknown Value

When using `DESC <table_name>;` What does the *YES* under **NULL** mean?
It means it can accept *Null* as a value.

So, to prevent that, use `NOT NULL` when specifying the data type.
For example:

> `CREATE TABLE tweets 
    (
        userName       VARCHAR(15)    NOT NULL,
        tweetContent   VARCHAR(140)   NOT NULL,
        likes          INT            NOT NULL
    );`

However, if you insert a empty value that does not allow null value, and you didn't set an default value, you will end up with an ***empty string***.

### - Default Values

If the value inserting is not specified, it will be replaced with the default value.

For instance:

> `CREATE TABLE tweets 
    (
        userName       VARCHAR(15)    DEFAULT   'unknown user',
        tweetContent   VARCHAR(140)   DEFAULT   'no content',
        likes          INT            DEFAULT   '0'
    );`

### - Combining NOT NULL with DEFAULT
You might be wondering, if we already specified the `DEFAULT` value, why do we still need to specify `NOT NULL`, since we already have a `DEFAULT` value?
The answer is that, when inserting data, we can still specify the value to be `NULL`.
So, to prevent that from happening, this is what we'll write:

> `CREATE TABLE tweets 
    (
        userName      VARCHAR(15)     NOT NULL    DEFAULT  'unknown user',
        tweetContent  VARCHAR(140)    NOT NULL    DEFAULT  'no content',
        likes         INT             NOT NULL    DEFAULT  '0'
    );`

### - Primary Key

A unique identifier. What it does is that it specify the columns that every value in that columns **must be unique.**

   **Why do we need key?**<br>
     To prevent identical data, such as ID, user_name in account table.

   **Why should we prevent identical data?**<br>
     So we can refer to the data we want **SPECIFICALLY**.

Use the following lines:

> `CREATE TABLE tweets1 
    (
        tweet_id      INT             NOT NULL,
        userName      VARCHAR(15)     NOT NULL    DEFAULT  'unknown user',
        tweetContent  VARCHAR(140)    NOT NULL,
        likes         INT,
        PRIMARY KEY (tweet_id)
    );`

However, it's impractical to specify the id every time, so we can use `AUTO_INCREMENT` to get around this:

> `CREATE TABLE tweets1 
    (
        tweet_id      INT             NOT NULL    AUTO_INCREMENT,
        userName      VARCHAR(15)     NOT NULL    DEFAULT  'unknown user',
        tweetContent  VARCHAR(140)    NOT NULL,
        likes         INT,
        PRIMARY KEY ('tweet_id')
    );`
    
Now, we on longer need to specify the id every single time.

**Exercise:**

`CREATE TABLE employees
    (
        id               INT             NOT NULL      AUTO_INCREMENT,
        last_name        VARCHAR(255)    NOT NULL,
        first_name       VARCHAR(255)    NOT NULL,
        middle_name      VARCHAR(255),
        age              INT             NOT NULL,
        current_status   VARCHAR(100)    NOT NULL      DEFAULT 'employed',
        PRIMARY KEY (id)
    )`
    
**Result**

*mysql> `DESC employees;`* <br><br>
` +----------------+--------------+------+-----+----------+----------------+
 | Field          | Type         | Null | Key | Default  | Extra          |
 +----------------+--------------+------+-----+----------+----------------+
 | id             | int(11)      | NO   | PRI | NULL     | auto_increment |
 | last_name      | varchar(255) | NO   |     | NULL     |                |
 | first_name     | varchar(255) | NO   |     | NULL     |                |
 | middle_name    | varchar(255) | YES  |     | NULL     |                |
 | age            | int(11)      | NO   |     | NULL     |                |
 | current_status | varchar(100) | NO   |     | employed |                |
 +----------------+--------------+------+-----+----------+----------------+`

<br><br>

# Chapter 4 : The Basic of "CRUD"

**CRUD** stands for:
- **C**reate
- **R**ead
- **U**pdate
- **D**elete

which are the most commonly used operations. 
And we have already covered the **C**reate part, so let's focus on the next thing – **R**ead.

## 4.1 Read Data

### - SELECT *
use `SELECT <fields_names> FROM <table_name>` to read the data.


#### All Fields

Use `*` to find all fields(columns)

`SELECT * FROM <table_name>;`


#### Specified Fields

Use `<column_name>` to specify the fields you want

` SELECT <column_name_1>, <column_name_2>
 FROM <table_name>;`
 
Note that the order of `<column_name>` matters.

### - WHERE clause

Use `WHERE` to get the information that fits the **CONDITION**, or you can say that **fits the description**.

>*e.g.*
>1. Show all cats that are 4 years old. <br>
>`SELECT * FROM cats
 WHERE age = 4;`
><br><br>
>2. Show all cats that are called 'Egg'. <br>
>*Note that it doesn't care about the uppercase or lowercase characters* <br>
>`SELECT * FROM cats
 WHERE name = 'Egg';`
>

### - AS (Aliases)
Use `AS` to specify the columns' names, so it's more **readable / intepretable** to human. <br>
As the course continues on, this will comes in handy as the result are getting messier and messier. Promise.

*e.g.*

cat_id --> **ID**, breed --> **Type of cat**, name --> **Cat's Name** <br>
> `SELECT
     cat_id AS "ID",
     breed AS "Type of cat",
     name AS "Cat's Name"
 FROM cats`

## 4.2 Update Data
Alter existing data.

### - UPDATE ... SET ...
Use the following syntax to update the existing value with `<new_value>` <br>
>`UPDATE <table_name> SET <column_name> = <new_value>
WHERE <where_to_perform>;` 

*e.g.*
> 1. update the breed name 'Tabby' to 'Shorthair'
>`UPDATE cats SET breed = 'Shorthair'
WHERE breed = 'Tabby';`
>
> 2. update the Misty's age to 14
> `Update cats SET age = 14
WHERE name = 'Misty';`

#### IMPORTANT NOTE:
Use **`SELECT` BEFORE** using `UPDATE` to check if you're updating the right data!

> For instance, use <br>
> **` SELECT breed
 FROM cats
 WHERE name = 'Ringo';`**
> <br><br>and before using<br>
> **` UPDATE cats
 SET breed = 'British Shorthair'
 WHERE name = 'Ringo';`**

## 4.3 Delete Data
Delete **entire row** from the table.

### - DELETE FROM
This is very similar to `SELECT`, just replace it with `DELETE` instead, and no field need to be specified.<br>
Concretely, write in the following form:
>` DELETE FROM <table_name>
 WHERE <condition>;`

#### IMPORTANT NOTE:
Just like update, use **`SELECT` BEFORE** using `DELETE` to check if you're deleting the right data!

> For instance, use <br>
> **` SELECT *
 FROM cats
 WHERE name = 'Egg';`**
> <br><br>and before using<br>
> **` DELETE FROM cats
 WHERE name = 'Egg';`**
 
#### ALSO IMPORTANT:
`DELETE FROM <table_name>` will delete **ALL ENTRIES** in the table, without having to rebuild the table like the `DROP` function.

### - CRUD Exercise

**Create some data**

Create Database called 'shirts_db'
> `CREATE DATABASE Shirts_db`

Create shirts table in the db
> `USE shirts_db`

>`CREATE TABLE shirts
 ( shirt_id    INT NOT NULL AUTO_INCREMENT,
   article     VARCHAR(255), 
   color       VARCHAR(255),
   shirt_size  VARCHAR(10),
   last_worn   INT,
   PRIMARY KEY (shirt_id)
 );`

Create some data for the table

> Insert multiple entries of data in a single command: <br> <br>
>`INSERT INTO shirts (article, color, shirt_size, last_worn)
 VALUES ('t-shirt', 'white', 'S', 10),
        ('t-shirt', 'green', 'S', 200),
	    ('polo shirt', 'black', 'M', 10),
	    ('tank top', 'blue', 'S', 50),
	    ('t-shirt', 'pink', 'S', 0),
	    ('polo shirt', 'red', 'M', 5),
	    ('tank top', 'white', 'S', 200),
	    ('tank top', 'blue', 'M', 15);`

> Insert one entry of data: <br> <br>
> `INSERT INTO shirts (article, color, shirt_size, last_worn)
 VALUE ('polo shirt', 'purple', 'M', 50);`

<br>

**Read some data**

Show article and shirt size
> `SELECT article, shirt_size FROM shirts;`

Show all fileds except for shirt_id
>`SELECT article, color, shirt_size, last_worn
 FROM shirts
 WHERE shirt_size = 'M';`

<br>

**Update some data**

Update all 
>`UPDATE shirts
 SET shirt_size = 'L'
 WHERE article = 'polo shirt';`

Update last worn 15 to 0
> `UPDATE shirts
 SET last_worn = 0
 WHERE last_worn = 15;`

Update shirt size to XS and color to off white to all white shirts
> `UPDATE shirts
 SET shirt_size = 'XS', color = 'off white'
 WHERE color = 'white';`

<br>

**Delete some data**

Delete old shirts that was last worn 200 days (exactly) ago
> `DELETE FROM shirts
 WHERE last_worn = 200;`

Change of taste, delete all tank tops
> `DELETE FROM shirts
 WHERE article = 'tank top';`

Delete all entries
> `DELETE FROM shirts;`

Delete the table
> `DROP table shirts;`

<br><br>

# Chapter 5 : Run SQL Files
To run SQL codes, we don't always have to write cmd codes over and over. <br>
Instead we can save them as as files and use `SOURCE <file_name>;` (*e.g.* `SOURCE test.sql;`) to run saved code in the file.

<br><br>

# Chapter 6 : The String Functions
Source : https://dev.mysql.com/doc/refman/8.0/en/string-functions.html

### - CONCAT()
Combine multiple columns and strings. <br>
`CONCAT(<column_name_1>, <column_name_2>, '<some strings>', ...);` <br>
*e.g.*
>`SELECT CONCAT(first_name, ' ' ,last_name) AS 'Full Name';`<br>

*e.g.*
>`SELECT CONCAT('Hello', ' ' ,'World');`

### - CONCAT_WS()
Concate **with SEPARATOR** (for CVS file, for example).<br>
Simply put the separator in the first item of the list of strings/columns: <br>
`CONCAT_WS(`**`<'seperator'>`**` , <column_name_1> , <column_name_2> , '<some strings>', ...);`

### - SUBSTRING() & SUBSTR()
Select only parts of strings that you want:<br>
`SELECT SUBSTRING('<text>', <index_of_the_starting_character>, <length_of_characters>);`<br>
*Note that, in SQL, index starts with 1, instead of 0 like in Python.* <br>
*`<Length of charaters>` means that it includes the starting character. Please refer to the following example.*

*e.g.* <br>

<table style="border:3px #cccccc solid;" cellpadding="10" border='1'>
  <tr style="font-wright:bold;text-align:center;">
    <th>'H'</th>
    <th>'e'</th>
    <th>'l'</th>
    <th>'l'</th>
    <th>'o'</th>
    <th>' '</th>
    <th>'W'</th>
    <th>'o'</th>
    <th>'r'</th>
    <th>'l'</th>
    <th>'d'</th>
  </tr>
  <tr style="text-align:center;">
    <td>1</td>
    <td>2</td>
    <td>3</td>
    <td>4</td>
    <td>5</td>
    <td>6</td>
    <td>7</td>
    <td>8</td>
    <td>9</td>
    <td>10</td>
    <td>11</td>
  </tr>
  <tr style="text-align:center;">
    <td>-11</td>
    <td>-10</td>
    <td>-9</td>
    <td>-8</td>
    <td>-7</td>
    <td>-6</td>
    <td>-5</td>
    <td>-4</td>
    <td>-3</td>
    <td>-2</td>
    <td>-1</td>
  </tr>
</table>


Start at the **2nd** character ('e') with a length of 4
> `SELECT SUBSTRING('Hello World', 2, 4);` <br>
> return **`'ello'`**

Start at **7th** character, **length not specified** (which means **ALL** the characters after the starting character)
> `SELECT SUBSTRING('Hello World', 7);` <br>
> return **`'World'`**

Start at **-7th** character (**counting backword**), **length not specified** (which means **ALL** the characters **AFTER** the starting character)
> `SELECT SUBSTRING('Hello World', -7);` <br>
> return **`'o World'`**

Combining `CONCAT()` and `SUBSTRING()` together <br>
>`SELECT CONCAT( SUBSTRING(title, 1, 15) , ' ...') AS 'Short Title'
 FROM books;`

### - REPLACE()
`REPLACE` some the specified strings with the alternative: <br>
`SELECT REPLACE ('<text>', '<what_to_replace>', '<alternative>');`

*e.g.*

Replace `'o'` with `'0'` <br>
> `SELECT REPLACE ('Hello World', 'o', '0');` <br>
> return `'Hell0 W0rld'`

Replace `' '` with `' and '` <br>
> `SELECT REPLACE ('Cheese bread coffee milk', ' ', ' and ');` <br>
> return `'Cheese and bread and coffee and milk'`

Replace `'e'` with `'3'` <br>
> `SELECT REPLACE ('America', 'e', '3');`
> return `'Am3rica'`

Combine `REPLACE()` and `SUBSTRING()`
> `SELECT SUBSTRING(REPLACE(title, 'e', '3'), 1, 10) AS 'Weird Strings'
FROM books;`

### - REVERSE()
`REVERSE()` Reverse your strings character by character.<br>

*e.g.*

> `SELECT REVERSE('Hello World');` <br>
> return `dlroW olleH`

### - CHAR_LENGTH()
Count characters in the given string using:
`SELECT CHAR_LENGTH(<text>);`

*e.g.*

Count the number of characters in 'Hello World'
> `SELECT CHAR_LENGTH('Hello World');`
> return `11`

Count the number of characters of book title
> `SELECT CHAR_LENGTH(title) FROM books;`

Combining `CHAR_LENGTH()` and `CONCAT()`
> `SELECT CONCAT(author_lname, ' is ', CHAR_LENGTH(author_lname), 'characters long')
FROM books;`

*If you want your SQL codes to look better, use this formatter: https://sql-format.com/*

### - UPPER() and LOWER()
Change **ALL** the string to upper case or lower case using
`SELECT UPPER('<text>');` or `SELECT LOWER('<text>');`

*e.g.*

Upper case 'Hello World'
> `SELECT UPPER('Hello World');`
> return `'HELLO WORLD'`

Lower case 'Hello World'
> `SELECT LOWER('Hello World');`
> return `'hello world'`

<br>

Note that `UPPER()` and `LOWER()` only takes **ONE argument**.<br>
So `UPPER(CONCAT('<text>','<text>'))` works, while `CONCAT(UPPER('<text>','<text>'))` does **not**. <br>
However, you can do it like this `CONCAT(UPPER('<text>'), UPPER('<text>'))`

<br><br>

# Chapter 7 : Refining Selection

### - DISTINCT
Get unique value (get rid of the duplcicate values).
`SELECT DISTINCT <field_name>;`

*e.g.*
> `SELECT DISTINCT released_year FROM books;` <br>
> `SELECT DISTINCT author_lname FROM books;`

Selecting distinct data that consider multiple columns <br>
we can combine it with `CONCAT()`: <br>
> `SELECT DISTINCT CONCAT(author_fname, ' ', author_lname) FROM books;` <br>
> return **ONE** column that combines the specified fields.

or, simply utilize the distinct function: <br>
> `SELECT DISTINCT author_fname, author_lname FROM books;` <br>
> return **TWO columns** – `<author_fname>` and `<author_lname>`.

### - ORDER BY
Sorting result (to find best seller, for example), using:<br>
`SELECT <field_name>
 FROM <table_name>
 ORDER BY <field_name> <method>;`

Note that `<method>` is default as **ascending** (`ASC`), <br>
to specify a **descending** order, use `DESC`.

Also, you don't need to select the field that you want to order by.

<br>

*e.g.*

Alphabetical
>`SELECT title FROM books` <br>
> **`ORDER BY title;`**

Numerical - books that has the most stock
> `SELECT stock_quantity FROM books` <br>
> **`ORDER BY stock_quantity DESC;`**

SELECT multiple columns
> `SELECT title, author_fname, author_lname FROM books` <br>
> **`ORDER BY 2;`** <br>
> *where **2** means the **second field** (`author_fname`)*

ORDER BY multiple columns
*first sort by the author's last name (`author_lname`), then sort by author's first name (`author_fname`)*
> `SELECT author_fname, author_lname FROM books` <br>
> **`ORDER BY author_lname, author_fname;`** <br>

or
> `SELECT author_fname, author_lname FROM books` <br>
> **`ORDER BY 2, 1;`** <br>

### - LIMIT
Limiting the entries of result. For example, get the first 3 result. <br>
`SELECT <field_name>
 FROM <table_name>
 LIMIT <starting_point>, <number_of_entries>;`  <br>
where `<starting_point>` starts at 0

Usually used with ORDER BY: <br>
`SELECT <field_name>
 FROM <table_name>
 ORDER BY <field_name> <method>
 LIMIT <starting_point>,  <number_of_entries>;` <br>

*e.g.*

Select 5 latest books
> `SELECT title, released_year
 FROM books
 ORDER BY released_year DESC` <br>
> **`LIMIT 5;`** 

Select 3-7 latest books
> `SELECT title, released_year
 FROM books
 ORDER BY released_year DESC` <br>
> **`LIMIT 2, 5;`** 


Select all latest books except first 5
> `SELECT title, released_year
 FROM books
 ORDER BY released_year DESC` <br>
> **`LIMIT 4, 123456789098;`** <br>
> where the `<number_of entries>` (`123456789098`) is just a random gigantic number

### - LIKE
Unlike the `WHERE` method that we went through, which finds you the **exact match**, <br>
`LIKE` allows us to find values that we only know parts of information. <br>

For instance, if we want to find all Harry Potter books, <br>
instead of typing the exact titles that we probably don't remember <br>
(*e.g.* `WHERE title = 'Harry Potter - The Philosopher's Stone'`), <br>
we can use `LIKE` function to find all books that has 'Harry Potter' in the books' title <br>
(*e.g.* `WHERE title LIKE '%Harry Potter%'`).

**Symbols that represent any character**
- `%` - The percent sign represents **zero**, **one**, or **multiple** characters
- `_` - The underscore represents a **single character** <br>
    e.g. find phone number : (235)234-4567 --> `LIKE '(___)___-____'`

<br>

*e.g.*

Select book titles that **start with 'The'**
> `SELECT title FROM books` <br>
> **`WHERE title LIKE 'The%'`**

Select book titles that **contain the word 'the'**
> `SELECT title FROM books` <br>
> **`WHERE title LIKE '%the%'`**

Find books stock quantity that is 4 figures (4-digit)
> `SELECT stock_quantity FROM books` <br>
> **`WHERE stock_quantity LIKE '____'`**

Find book titles that has a percent sign `%`.
> (use escape sign – **backslash `\`** with percent, like `'\%'` an `'\_'` ) <br>
> `SELECT title FROM books` <br>
> **`WHERE title LIKE '%\%%'`**

Select book titles **ends with 'd' and a character behind it.**
> `SELECT title FROM books` <br>
> **`WHERE title LIKE '%d_'`**

<br><br>

# Chpater 8 : The Aggregate Functions

Aggregate data to find "meaning" out of it.

### - Count()
To find out "How many" of something that we want, use `COUNT()` function.

*e.g.*

Count how many rows in the books.
> `SELECT COUNT(*) FROM books;`

Count how many author first name in books.
> `SELECT COUNT(author_fname) FROM books;`

Count how many unique author first name in books.
> `SELECT COUNT(DISTINCT author_fname) FROM books;`

Count how many unique author in books.
> `SELECT COUNT(DISTINCT author_fname, author_lname) FROM books;`

Count how many title contain the word "the"
> `SELECT COUNT(*) FROM books WHERE title LIKE '%the%';`

### - GROUP BY
This summarize the identical data (where we group by) into a **row**.
Very important function, needs to be used aloneside with other function.

For instance, you can group the books by, say, genre, **and** find out the average price of **each** genre.

*e.g.*

Count the number of books each author had published.
> `SELECT author_fname, author_lname, COUNT(*)` <br>
> `FROM books` <br>
> **`GROUP BY author_lname, author_fname;`**

Count number of books was released each year.
> `SELECT released_year, COUNT(*)` <br>
> `FROM books` <br>
> **`GROUP BY released_year`** <br>
> `ORDER BY released_year DESC;`

### - MIN() & MAX()
Find the minimum `MIN()` or maximum `MAX()` value in the group.

*e.g.*

Find the oldest book
> `SELECT MIN(released_year) FROM books;`

Find the shortest books (with least pages)
> `SELECT MIN(pages) FROM books;`

Find the longest books (with most pages)
> `SELECT MAX(pages) FROM books;`

Find the **year** that **each author** published their **first book**.<br>
*Note: use with `GROUP BY`*
> `SELECT author_fname, author_lname, MIN(released_year) FROM books` <br>
> `GROUP BY author_fname, author_lname;`

Find pages of each author's longest book.
> `SELECT author_fname, author_lname, MAX(pages) FROM books` <br>
> `GROUP BY author_fname, author_lname;`

#### Problem:
**Now, what if we want to find the *books title* of the longest book?**

You might think, that's easy! Just use this:
> `SELECT MAX(pages), title FROM books;` <br>

Unfortunately,**THIS WILL NOT WORK!** It will show only the a row of data, with a correct MAX pages, but not the correct title.

OK, then how about we put it in the `WHERE` clause:
> `SELECT title FROM books` <br>
> **`WHERE pages = MAX(pages);`**

> return: `ERROR 1111 (HY000): Invalid use of group function`

F, we cannot use MIN()/MAX() function like this. So what do we do?

Now, let's introduce the concept of **SUBQUERIES**.
> `SELECT title FROM books` <br>
> **`WHERE pages`** = **`(SELECT MAX(pages) FROM books);`**

What this means is that, essentially, this will first run the subqueries **`(SELECT MAX(pages) FROM books);`** to get the MIN()/MAX() value, and THEN run the original query.
However, note that this method is **SLOW**, since it basically runs **two queries**.

So, what we can also do is go back to our old friends `ORDER BY` and `LIMIT` to help us, simply using:
> `SELECT title FROM books`<br>
> `ORDER BY pages ASC` <br>
> `LIMIT 1;`

This will also give us the exactly same result we want, **quicker**.

So, one take-a-way of this problem is that we don't always need to use the most complicated method or syntax or whatever to get our result. Instead, there might be other eaiser way to solve the problem simply by combining and utilizing what we've learned.

### - SUM()
Add up values to get a new value using `SUM()`.

*e.g.*

Find out how many pages there are?
> `SELECT SUM(pages) FROM books;`

Find out how many pages that each author wrote?
> `SELECT author_fname, author_lname, SUM(pages) FROM books` <br>
> `GROUP BY author_fname, author_lname;`

### - AVG()
Get the average value using `AVG()`.

*e.g.*

Calculate the average pages of all books.
> `SELECT AVG(pages) FROM books;`

Calculate the average stock quantity of each released year (`GROUP BY`).
> `SELECT released_year, AVG(stock_quantity) FROM books` <br>
> `GROUP BY released_year;`

Calculate the average pages of each author.
> `SELECT author_fname, author_lname, AVG(pages) FROM books` <br>
> `GROUP BY author_fname, author_lname;`

<br><br>

# Chapter 9 : More into Data Types

So far, we've only covered `INT` and `VARCHAR`, so now we're gonna dive deeper into other data types.

## Text
So, we already know `VARCHAR`, let's talk about another data type that also store text data – `CHAR`.

### - CHAR
CHAR has a **fixed length**. This will chop off(*truncate*) the inputs if the inputs are over the specified length, or add spaces if the input are below the specified length.

Length can be specified like:
`CHAR(<number>)` where number can be from 0 up to 255. (*e.g.* CHAR(5), CHAR(255))
This is typically used when you know something is **fixed length** (obviously) like:
- YES/No flags: **Y/N** (CHAR(1))
- State Abbreviation: **CA, NY, AZ** (CAHR(2))
- Sex: **M/F**(CHAR(1))

or any binary options.

*e.g.*

<table style="border:3px #cccccc solid;" cellpadding="10" border='1'>
  <tr>
    <th>Value</th>
    <th>CHAR(4)</th>
    <th>CHAR(4) Storage</th>
    <th>VARCHAR(4)</th>
    <th>VARCHAR(4) Storage</th>
  </tr>
  <tr>
    <td>' '</td>
    <td>'    '</td>
    <td>4 bytes</td>
    <td>''</td>
    <td>1 byte</td>
  </tr>
  <tr>
    <td>'ab'</td>
    <td>'ab  '(+ two spaces)</td>
    <td>4 bytes</td>
    <td>'ab'</td>
    <td>3 bytes</td>
  </tr>
  <tr>
    <td>'abcd'</td>
    <td>'abcd'</td>
    <td>4 bytes</td>
    <td>'abcd'</td>
    <td>5 bytes</td>
  </tr>
  <tr>
    <td>'abcd'</td>
    <td>'abcd'</td>
    <td>4 bytes</td>
    <td>'abcd'</td>
    <td>5 bytes</td>
  </tr>
</table>

That being said, in most of the time, we just need to use VARCHAR.

## Numbers
So, we already know `INT`, which stores **whole numbers**. Noe, let's talk about another data type that also store text data – `DECIMAL()`.

### - DECIMAL()
*exact*
Using `DECIMAL(<M>, <D>)`, you'll need to specify 2 numbers:
- **total** number of digits(`<M>`), which range from 1 to 65, and 
- digit(s) **after** the decimal point (`<D>`).

*e.g.*

**DECIMAL(5,2):**
<table  style="border:3px #cccccc solid;" cellpadding="10" border='1'>
  <tr>
    <th>Inputs</th>
    <th>Result</th>
    <th>Remark</th>
  </tr>
  <tr>
    <td>7</td>
    <td>7.00</td>
    <td></td>
  </tr>
  <tr>
    <td>789789</td>
    <td>999.99</td>
    <td>(max)</td>
  </tr>
  <tr>
    <td>34.88</td>
    <td>34.88</td>
    <td></td>
  </tr>
  <tr>
    <td>289.9999</td>
    <td>290.00</td>
    <td>(round up)</td>
  </tr>
    <tr>
    <td>1.9999</td>
    <td>2.00</td>
    <td>(round up)</td>
  </tr>
</table>


### - FLOAT() & DOUBLE()
*approximate* --> store larger number using less space.(Double is more percise)

<table  style="border:3px #cccccc solid;" cellpadding="10" border='1'>
  <tr>
    <th>Data Type</th>
    <th>Memory Needed</th>
    <th>Percision Issues</th>
  </tr>
  <tr>
    <td>FLOAT</td>
    <td>4 Bytes</td>
    <td>~7 digits</td>
  </tr>
  <tr>
    <td>DOUBLE</td>
    <td>8 Bytes</td>
    <td>~15 digits</td>
  </tr>
</table>

In most cases, use **`DECIMAL`** to avoid percision issues!

## Dates and Times
Store data in date and time formats.
Reference: https://dev.mysql.com/doc/refman/8.0/en/date-and-time-functions.html


### - Data Type

### - DATE
Store date *without a time* in **'YYYY-MM-DD'** format.

### - TIME
Values with a time but no *date* in **'hh\:mm\:ss'** format.

### - DATETIME
Used most often, this save DATE + TIME** in **'YYYY-MM-DD hh\:mm\:ss'** format.

### - TIMESTAMPS
A standardized name and time format accross programming languages. This contains both DATE and TIME, ranging from '1970-01-01 00:00:01 UTC' to '2038-01-19 03:14:07'. This is generally used for something that was created at that moment(say placing an order). This takes up only half of the space compares to DATETIME.


*e.g.*
To create a table of comment, for example, using `TIMESTAMP`: 

> `CREATE TABLE comment(` <br>
> `	  id         INT    NOT NULL    AUTO_INCREMENT,` <br>
> `	  content    VARCHAR(255),` <br>
> **`	  created_at TIMESTAMP DEFAULT NOW(),`**  <br>
> *--> to keep the created time everytime a new comment is generated* <br>
> **`	  changed_at TIMESTAMP DEFAULT NOW() ON UPDATE CURRENT_TIMESTAMP,`** <br>
> *--> to keep track on the last updated time whenever the comment was updated, using `ON UPDATE CURRENT_TIMESTAMP`*  <br>
> `	  PRIMARY KEY(id)` <br>
> `);`


### - Current Date & Time

### - CURDATE()
Gives current date.

### - CURTIME()
Gives current time.

### - NOW()
Gives current date + time.


## Formatting Dates
*Note* This works for both DATE and DATETIME.

### - YEAR(), MONTH(), DAY()
Use `YEAR(<DATE>)`, `MONTH(<DATE>)` `DAY(<DATE>)` to extract the year(*YYYY*), month(*MM*), day(DD), respectively, of the date.

### - DAYNAME()
Use `DAYNAME(<DATE>)` to get the day's name of the week (*e.g.* Monday, Saturday).
*Note* This **starts at Sunday**.

### - DAYOFWEEK()
Use `DAYNAME(<DATE>)` to get the day of the week in **numeric format** (*e.g.* 2, 7). <br>
*Note* This **starts at Sunday(*1*)**.

### - DAYOFYEAR()
Use `DAYOFYEAR(<DATE>)` to get the how many days was there in that year (*e.g.* 1943-12-25 --> **359**) <br>


## Formatting Times
*Note* This works for both **TIME** and **DATETIME**.

### - HOUR(), MINUTE(), SECOND()
Use `HOUR(<TIME>)`, `MINUTE(<TIME>)`, `SECOND(<TIME>)` to extract the hour(*hh*), minute(*mm*), second(ss), respectively, of the time. <br>


## - DATE_FORMAT()
To help you generate format that you want without using `CONCAT()`.
Use in `DATE_FORMAT(<DATE/DATETIME>, <format>)`

*e.g.*

Born on which day of the week (`%W`)
> `SELECT` **`DATE_FORMAT(birthDT, 'Was born on a %W')`** <br>
> `FROM people;`

US format
> `SELECT` **`DATE_FORMAT(birthDT, '%m/%d/%Y')`** <br>
> `FROM people;`
> return in `MM/DD/YYYY`

English format with suffix on date (*e.g.1st, 2nd*)
> `SELECT` **`DATE_FORMAT(birthDT, '%M/%D/%Y')`** <br>
> `FROM people;`
> return in `Month_name/Date/YYYY` , (*e.g. **December-25th-1943***)

## Date Math

### - DATEDIFF()
Use `DATEDIFF(<DATE_1>, <DATE_2>)` to calculate the **day(s)** difference between two different dates (`<Date_1>` - `<Date_2>`).

*e.g.*
How many days ago were people born?
> `SELECT name, birthdate, DATEDIFF(NOW(), birthdate)`
> `FROM people;`


### ADD/SUB Date

Specify an **`INTERVAL`** and add (`DATE_ADD()`, `<DATETIME> + INTERVAL <interval>`),<br>
or subtract (`DATE_SUB()`, `<DATETIME> - INTERVAL <interval>`) to given date:

#### - DATE_ADD()
`DATE_ADD(<DATETIME>, INTERVAL <interval>)`

#### - DATE_SUB()
`DATE_SUB(<DATETIME>, INTERVAL <interval>)`

#### - DATE + INTERVAL
`<DATETIME> + INTERVAL <interval> + INTERVAL <interval> + ... `
#### - DATE - INTERVAL
`<DATETIME> - INTERVAL <interval> - INTERVAL <interval> - ... `

*e.g.*

Add one month to birthdate
> `SELECT name, birthDT,` **`DATE_ADD(birthDT, INTERVAL 1 MONTH)`** <br>
> `FROM people;`

## Exercise

- a good case of CHAR(just make one up):
> is_married(Y/N) CHAR(1)
> completed(Y/N) CHAR(1)
> Stock_symbol CHAR(5)

- create an inventory table that has 3 columns – item_name, price (always less than 1 million dollar), quantity. <br>
> `CREATE TABLE inventories(
    item_name VARCHAR(100),
    price     DECIMAL(8,2),
    quantity  INT
);`

- difference between DATETIME and TIMESTAMP
> Storage size DATETIME ~= TIMESTAMP * 2
> Range - TIMESTAMP: 1970-01-01 00:00:01 to 2038-1-19 03:14:07; DATETIME 1000-01-01 00:00:01 to 9999-12-31 23:59:59
> Usage - TIMESTAMP for metadata like last_updte; DATETIME for specific dates like birthday

- print out the current time (but not the date)
> `SELECT CURTIME();`

- print out the current date (but not the time)
> `SELECT CURDATE();`

- print out the current day of the week (number)
> `SELECT DAYOFWEEK(NOW());` --> *Sunday = 1, Saturday = 7*
> `SELECT DATE_FORMAT(NOW(), '%w')` --> *Sunday = **0**, Saturday = 6*

- print out the current day of the week (name)
> `SELECT DAYNAME(NOW());`
> `SELECT DATE_FORMAT(NOW(), '%W');`

- print out the current time using MM/DD/YYYY format
> `SELECT DATE_FORMAT(NOW(), '%m/%d/%Y');`

- print out the current day and time using *'April 2nd at 3:15'* format
> `SELECT DATE_FORMAT(NOW(), '%M %D at %h:%i');`

- create a tweet table that has 3 columns – username, tweet_content, created_time. <br>
> `CREATE TABLE tweets(
    user_name     VARCHAR(20),
    tweet_content VARCHAR(140),
    created_time  TIMESTAMP    DEFAULT NOW()
);`

<br><br>

# Chapter 10 : Logical Operators
To make complex selection, such as more than 1 condition.

### - Not Equal `!=`
The opposite of **`=`**.

*e.g.*

Find books that was released in 2007
> `SELECT title, released_year FROM books` <br>
> `WHERE released_year = 2017;`

Find books that was **NOT** released in 2007
> `SELECT title, released_year FROM books` <br>
> `WHERE released_year != 2017;`

### - NOT LIKE
The opposite of `LIKE`.

*e.g.*

Find book titles that content the word *'the'*
> `SELECT title FROM books` <br>
> `WHERE title LIKE '%the%';`

Find book titles that does **NOT** content the word *'the'*
> `SELECT title FROM books` <br>
> `WHERE title NOT LIKE '%the%';`

### - Greater Than `>`
Find values that is greater than (`>`) a certain value.

*e.g.*
Find books released after 2000 (does not include 2000)
> `SELECT titles, released_year FROM books` <br>
> `WHERE released_year > 2000` <br>
> `ORDER BY released_year;`

Find books released after 2000 (including 2000)
> `SELECT titles, released_year FROM books` <br>
> `WHERE released_year >= 2000` <br>
> `ORDER BY released_year;`


### - Less Than `<`
Find values that is less than (`<`) a certain value.

*e.g.*
Find books released before 2000 (does not include 2000)
> `SELECT titles, released_year FROM books` <br>
> `WHERE released_year < 2000` <br>
> `ORDER BY released_year;`

Find books released after 2000 (including 2000)
> `SELECT titles, released_year FROM books` <br>
> `WHERE released_year <= 2000` <br>
> `ORDER BY released_year;`

#### something weird

What is the result of `SELECT 99 > 1;`?
> `1` --> which, in a sense, means TRUE (boolean)

What about characters?

- `SELECT 'a' > 'b';`?
> `0` --> False

- `SELECT 'a' = 'b';`?
> `0` --> False

- `SELECT 'a' < 'b';`?
> `1` --> **True!**

- `SELECT 'h' > 'q';`?
> `0` --> False

- `SELECT 'h' = 'q';`?
> `0` --> False

- `SELECT 'h' < 'q';`?
> `1` --> **True!**

- `SELECT 'A' > 'a';`?
> `0` --> False

- `SELECT 'A' = 'a';`?
> `1` --> **True!**

- `SELECT 'A' < 'a';`?
> `0` --> False!

### - AND `&&`
Usually used with `WHERE` clause where **All conditions are TRUE**: <br>
`WHERE <condition_1> AND/&& <condition_2> AND/&& <condition_3>` ...


Find books that has less than 100 quantity in stock **AND** was released after 2010 (including)
> `SELECT title, stock_quantity, released_year` <br>
> `FROM books` <br>
> `WHERE` `stock_quantity < 100` **`AND`** `released_year >= 2010;`

Find books that has less than 100 quantity in stock **AND** was released after 2010 (including) **AND** author is 'Eggers'
> `SELECT title, author_lname, stock_quantity, released_year` <br>
> `FROM books` <br>
> `WHERE` `stock_quantity < 100` **`&&`** `released_year >= 2010` **`&&`** `author_lname = 'Eggers';` 

<br>

#### something not that weird

`SELECT 1 < 5 && 7 = 9;` ?
> `1` && `0` --> `0` <br>
> --> **FALSE!**

`SELECT -10 > -20 && 0 <= 0;` ?
> `1` && `1` --> `1` <br>
> --> **TRUE!**

`SELECT -40 <= 0 AND 10 > 40;` ?
> `1` && `1` --> `1` <br>
> --> **TRUE!**

### - OR  `||`
Usually used with `WHERE` clause where **any of the condition is TRUE**: <br>
`WHERE <condition_1> OR/|| <condition_2> OR/|| <condition_3>` ...

Find books that has less than 100 quantity in stock **OR** was released after 2010 (including)
> `SELECT title, stock_quantity, released_year` <br>
> `FROM books` <br>
> `WHERE` `stock_quantity < 100` **`OR`** `released_year >= 2010;`

Find books that has less than 100 quantity in stock **OR** was released after 2010 (including) **OR** author is 'Eggers'
> `SELECT title, author_lname, stock_quantity, released_year` <br>
> `FROM books` <br>
> `WHERE` `stock_quantity < 100` **`||`** `released_year >= 2010` **`||`** `author_lname = 'Eggers';` 

<br>

#### something not that weird
`SELECT 40 <= 100 || -2 > 0;`
> `1` || `0` --> `1` <br>
> --> **TRUE!**

`SELECT 10 > 5 || 5 = 5;`
> `1` && `1` --> `1` <br>
> --> **TRUE!**

`SELECT 'a' = 5 || 3000 > 2000;`
> `0` && `1` --> `1` <br>
> --> **TRUE!**

### - BETWEEN
Find value within the range: `WHERE` *`<data>`* **`BETWEEN`** *`<lower_limit>`* **`AND`** *`<upper_limit>`* <br>
Simply think of it as a combination of `WHERE` *`<data>`* **`>=`** *`<lower_limit>`* **`&&`** *`<data>`* **`<=`** *`<upper_limit>`* --> ***INCLUSIVE***

*e.g.*

Find books released between 2004 ~ 2015
> `SELECT title, released_year FROM books` <br>
> `WHERE released_year BETWEEN 2004 AND 2015;`


### - NOT BETWEEN 
The opposite of `BETWEEN`.

*e.g.*

Find books released **NOT** between 2004 ~ 2015
> `SELECT title, released_year FROM books` <br>
> `WHERE released_year` **`NOT BETWEEN 2004 AND 2015;`**


### - CAST()
Coverting data to the data type that we want: <br>
`CAST( <data> AS <DATA_TYPE>)`.

*e.g.*

Coverting STRING(`'2017-05-02'`) to DATETIME:
> `SELECT` **`CAST('2017-05-02' AS DATETIME);`** <br>
> return `'2017-05-02 00:00:00'` (the TIME part is automatically filled with )

Find people who were born after 1980 and before 2000 (used with `BETWEEN`)
> `SELECT name, birthDT FROM people` <br>
> `WHERE birthDT` **`BETWEEN CAST('1980-01-01' AS DATETIME) AND CAST('1999-12-31' AS DATETIME);`**

Find people who were born before 1980 or after 2000 (used with `NOT BETWEEN`)
> `SELECT name, birthDT FROM people` <br>
> `WHERE birthDT` **`NOT BETWEEN CAST('1980-01-01' AS DATETIME) AND CAST('1999-12-31' AS DATETIME);`**

### - IN
Kind of like a list of condition, return values that fits in any given condition in the list. <br>
A shorter way to use `OR`.

*e.g.*

Using `OR`:
> `SELECT title, author_lname FROM books` <br>
> `WHERE author_lname = 'Carver' OR
       author_lname = 'Lahiri' OR
       author_lname = 'Smith';`

Using `IN`:
> `SELECT title, author_lname FROM books` <br>
> `WHERE author_lname` **`IN`** `('Carver', 'Lahiri', 'Smith');`

return same result.


### - NOT IN
The opposite of `IN`, which means **EXCLUDING** certain values.

*e.g.*

Find books that are not published in an even year.
Using `OR`:
> `SELECT title, released_year FROM books` <br>
> `WHERE released_year != 2000 AND
       released_year != 2002 AND
       released_year != 2004 AND
       released_year != 2006 AND
       released_year != 2008 AND
       released_year != 2010 AND
       released_year != 2012 AND
       released_year != 2014 AND
       released_year != 2016 AND
       released_year != 2018 AND
       released_year != 2020;`

Using `IN`:
> `SELECT title, released_year FROM books` <br>
> `WHERE released_year` **`NOT IN`** `(2000, 2002, 2004, 2006, 2008, 2010, 2012, 2014, 2016, 2018, 2020);`

Find books that are published after 2000 but not in an even year.
> `SELECT title, released_year FROM books` <br>
> `WHERE released_year >= 2000`<br>
> **`AND`** `released_year` **`NOT IN`** `(2000, 2002, 2004, 2006, 2008, 2010, 2012, 2014, 2016, 2018, 2020);`


*Programming approach: the remainder `%`.*
> `SELECT title, released_year FROM books` <br>
> `WHERE released_year >= 2000`<br>
> **`AND released_year % 2 != 0;`** --> the remainder when divided by 2 != 0 means 'not even number' (or odd number)

Performance difference: Note that `NOT IN` takes up a lot more time then using this programming approach (as it compares every individual value with the list, instead of simply finding values that are in the list).

### - Case Statement
This allows us to work with **conditional logic**. Think of it as the *If... Else.. statement* in other programming languages.

Let's first look at this example, to get an idea of what this mean.
*Visualization of stock quantity:*
> `SELECT title, stock_quantity, 
    CASE
        WHEN stock_quantity  BETWEEN   0 AND  50   THEN '*'
        WHEN stock_quantity  BETWEEN  51 AND 100   THEN '**'
        WHEN stock_quantity  BETWEEN 101 AND 200   THEN '***'
        WHEN stock_quantity  BETWEEN 201 AND 500   THEN '****'
        ELSE '*****'
    END AS 'STOCK'
FROM books;`

return
<table  style="border:3px #cccccc solid;" cellpadding="10" border='1'>
<tr><th> title                                               </th><th> stock_quantity </th><th> STOCK </th></tr>
<tr><td> The Namesake                                        </td><td>             32 </td><td> *     </td></tr>
<tr><td> Norse Mythology                                     </td><td>             43 </td><td> *     </td></tr>
<tr><td> American Gods                                       </td><td>             12 </td><td> *     </td></tr>
<tr><td> Interpreter of Maladies                             </td><td>             97 </td><td> **    </td></tr>
<tr><td> A Hologram for the King: A Novel                    </td><td>            154 </td><td> ***   </td></tr>
<tr><td> The Circle                                          </td><td>             26 </td><td> *     </td></tr>
<tr><td> The Amazing Adventures of Kavalier & Clay           </td><td>             68 </td><td> **    </td></tr>
<tr><td> Just Kids                                           </td><td>             55 </td><td> **    </td></tr>
<tr><td> A Heartbreaking Work of Staggering Genius           </td><td>            104 </td><td> ***   </td></tr>
<tr><td> Coraline                                            </td><td>            100 </td><td> **    </td></tr>
<tr><td> What We Talk About When We Talk About Love: Stories </td><td>             23 </td><td> *     </td></tr>
<tr><td> Where I'm Calling From: Selected Stories            </td><td>             12 </td><td> *     </td></tr>
<tr><td> White Noise                                         </td><td>             49 </td><td> *     </td></tr>
<tr><td> Cannery Row                                         </td><td>             95 </td><td> **    </td></tr>
<tr><td> Oblivion: Stories                                   </td><td>            172 </td><td> ***   </td></tr>
<tr><td> Consider the Lobster                                </td><td>             92 </td><td> **    </td></tr>
<tr><td> 10% Happier                                         </td><td>             29 </td><td> *     </td></tr>
<tr><td> fake_book                                           </td><td>            287 </td><td> ****  </td></tr>
<tr><td> Lincoln In The Bardo                                </td><td>           1000 </td><td> ***** </td></tr>
</table>

<br><br>
Now, let's break it down:
Now we can see the structure of CASE Statement looks like this:
> `CASE
    WHEN <field> <condition> THEN <output>
    ELSE <output>
END AS <new_field_name>;`

And, as we can see, case statment is built up with **5** parts.<br>
    1-1) **`CASE`**: to declare the **beginning**of a case statement.<br>
    1-2) **`WHEN ... THEN ... `**: to specify a **conditional logic**. (There can many different conditional logic in one statement.)<br>
    1-3) **`ELSE ...`**: to give a logic to conditions that were yet specified.<br>
    1-4) **`END`**: to **finish** the case statement.<br>
    1-5) **`AS`**: to give the new column a name (**aliase** *(refer to Chapter 4 - 4.1)*).

To make the given example a little more **Succinct**, we can take the advantage of the excution order. <br>
As the runs one line at a time, we can actually write it this way:
> `SELECT title, stock_quantity, 
    CASE
        WHEN stock_quantity  <=  50   THEN '*'
        WHEN stock_quantity  <= 100   THEN '**'
        WHEN stock_quantity  <= 200   THEN '***'
        WHEN stock_quantity  <= 500   THEN '****'
        ELSE '*****'
    END AS 'STOCK'
FROM books;`

So when it executes, it will check if the value is <= 50, and then <= 100, and then <=200, and so on, until it finds a match. Hence, this will give us the exact same outcome.

### Exercises:

1. Evaluate the followings: <br>
- `SELECT 10 != 10;`

> `0` (FALSE)

- `SELECT 15 > 14 && 99-5 <= 94;`

> `1` (TRUE)

- `SELECT 1 IN (5,3) || 9 BETWEEN 8 AND 10;`

> `1` (TRUE)


2. Select all books writen before 1980 (not inclusive)

> `SELECT title, released_year FROM books
WHERE released_year < 1980;`


3. Select all books written by Eggers or Chabon

> `SELECT title, author_lname FROM books
WHERE author_lname IN ('Eggers', 'Chabon');`


4. Select all books written by Lahiri, published after 2000

> `SELECT title, author_lname, released_year FROM books
WHERE author_lname = 'Lahiri' && released_year >= 2000;`


5. Select all books where the page counts between 100 and 200

> `SELECT title, pages FROM books
WHERE pages BETWEEN 100 AND 200;`


6. Select all books where author's last name starts with a 'C' or an 'S'

> `SELECT title, author_lname FROM books
WHERE
    author_lname LIKE 'C%' || 
    author_lname LIKE 'S%';`

or

> `SELECT title, author_lname FROM books
WHERE
    SUBSTR(author_lname,1,1) IN ('C', 'S');`


7. Select title, author's last names, and "Types" if title contains:
    'stories' --> 'Short Story',
    'Just kids and heartbreaking work' --> 'Memoir'
    everything else --> 'Novel'

> `SELECT title, author_lname, 
    CASE
        WHEN title LIKE '%stories%' THEN 'Short Story'
        WHEN title IN ('Just kids', 'A Heartbreaking Work of Staggering Genius') THEN 'Memoir'
        ELSE 'Novel'
    END AS 'TYPE'
FROM books;`

or

>`SELECT title, author_lname, 
    CASE
        WHEN title LIKE '%stories%' THEN 'Short Story'
        WHEN title LIKE 'Just kids%' OR
             title LIKE 'A Heartbreaking Work%' THEN 'Memoir'
        ELSE 'Novel'
    END AS 'TYPE'
FROM books;` 


8. Find out how many book(s) each author has written

> `SELECT author_fname, author_lname,
    CASE
        WHEN COUNT(title) > 1 THEN CONCAT(COUNT(*), ' books')
        ELSE CONCAT(COUNT(title), ' book')
    END AS 'COUNT'
FROM books
GROUP BY author_lname, author_fname;`

<br><br>

# Chapter 11 : Work with Multiple Tables – One To Many
*Related Data.*

In the real world, data are *MESSY* and *INTERRELATED*.

## Types of Data Relationships – Relationship Basic

**1. One to One Relationship** (not that common) <br>
 *e.g.* One customer to One customer's detail (exclusively, not useful for others).
 
**2. One to Many Relationship** (most common) <br>
 *e.g.* One book can have multiple reviews, but a review can only be for a book. <br>
 *e.g.* One customer can have many orders, but one order can only belong to one customer.

**3. Many to Many Relationship** <br>
 *e.g.* One author can have many books, and one book can have many authors. <br>
 *e.g.* One post can have many tags, and one tag can belongs many post. <br>
 *e.g.* One student can take many classes, and one class can have many students. <br>
 *e.g.* One tv series can have many reviews written by many reviewers, and one reviewer can write many reviews on many tv series.

## One To Many

**Customers & Orders**

### What data do we want to store?
 - Customer's first and last name
 - Customer's email
 - Date of the purchase
 - Price of the order

### How can we store them?
**Solution 1** : Store in **ONE** table:<br>
> ***order* table:**
>  - first_name
>  - last_name
>  - email
>  - order_date
>  - amount

**Problems** using only one table:
 - Many duplicated data (waste)
 - Null for those who haven't placed an order (inconsistant)

**Solution 2** Store in **TWO** tables:<br>
> ***costomers* table:**
>  - **costomer_id** (PRIMARY KEY)
>  - first_name
>  - last_name
>  - email
> 
> ***orders* table:**
>  - order_id **(PRIMARY KEY)**
>  - order_date
>  - amount
>  - **customer_id** **(FOREIGN KEY)**
> 
> <br>
> Where two tables are linked with **customer_id**. So, we can minimize the duplicated data.

*Note: **FOREIGN KEY** allows us to use only customer_id that already exist!*

Now, let's create some tables:
> `CREATE TABLE customers
(
	id INT AUTO_INCREMENT  PRIMARY KEY,
	first_name VARCHAR(100),
	last_name VARCHAR(100),
	email VARCHAR(100)
);`

> `CREATE TABLE orders
(
	id INT AUTO_INCREMENT  PRIMARY KEY,
	order_date DATE,
	amount DECIMAL(8,2),
	customer_id INT,
	FOREIGN KEY(customer_id) REFERENCES customers(id)
);`

And, insert some data:
> `INSERT INTO customers (first_name, last_name, email) 
VALUES ('Boy', 'George', 'george@gmail.com'),
       ('George', 'Michael', 'gm@gmail.com'),
       ('David', 'Bowie', 'david@gmail.com'),
       ('Blue', 'Steele', 'blue@gmail.com'),
       ('Bette', 'Davis', 'bette@aol.com');`


> `INSERT INTO orders (order_date, amount, customer_id)
VALUES ('2016/02/10', 99.99, 1),
       ('2017/11/11', 35.50, 1),
       ('2014/12/12', 800.67, 2),
       ('2015/01/03', 12.50, 2),
       ('1999/04/11', 450.25, 5);`

Now, our data is set up, try inserting this:
> `INSERT INTO orders (order_date, amount, customer_id)
VALUES ('2016/06/06', 33.67, 98);`<br>
>
> return `ERROR 1452 (23000): Cannot add or update a child row: a foreign key constraint fails ('shop'.'orders', CONSTRAINT 'orders_ibfk_1' FOREIGN KEY ('customer_id') REFERENCES 'customers' ('id'))`

We get an error because the FOREIGN KEY does not exist!

## Join
To join tables

Now, how do we find the orders of *Boy George*? <br>
We can, of course use subqueries
> `SELECT * FROM orders
WHERE customer_id = (
	SELECT id FROM customers
	WHERE last_name = 'George'
);`

But, what if we also want to see the name of *Boy George*?(which means we need to synthesis of two different table) <br>
Here, we use **`JOIN`**.

### - INNER JOIN
By calling two table and joinning them on where they match. <br>
Here's a picture of the idea of inner join:

In [1]:
from IPython.display import Image
Image(url='https://www.w3schools.com/sql/img_innerjoin.gif')

#### > *IMPLICIT* INNER JOIN
> `SELECT * 
FROM customers, orders 
WHERE customers.id = orders.customer_id;`

#### > *EXPLICIT* INNER JOIN
> `SELECT * 
FROM customers 
INNER JOIN orders 
    ON customers.id = orders.customer_id;`

or

> `SELECT * 
FROM customers 
JOIN orders 
    ON customers.id = orders.customer_id;`

NOTE: 
- To call `id`'s of different tables, we can use `<table_name>.id` to specify which `id` are we calling at the moment.<br>
- When joinning thing, it's better we do it *EXPLICIT*ly. <br>
- The order does **MATTER**!

### - LEFT JOIN
Use everthing from the left table, and join it with the right table for only things that are match the left table.

In [2]:
Image(url='https://www.w3schools.com/sql/img_leftjoin.gif')

To further demonstrate the difference between **INNER JOIN** and **LEFT JOIN**, let's continue using the customers_orders data we created.

Let's say we want to check out the total amount each person purchased:<br>

**INNER JOIN**
> `SELECT first_name, last_name, SUM(amount) AS 'total_amount'
 FROM customers
 INNER JOIN orders
   ON orders.customer_id = customers.id
 GROUP BY customers.id;`

return
>`+------------+-----------+--------------+
| first_name | last_name | total_amount |
+------------+-----------+--------------+
| Boy        | George    |       135.49 |
| George     | Michael   |       813.17 |
| Bette      | Davis     |       450.25 |
+------------+-----------+--------------+`

**LEFT JOIN**
> `SELECT first_name, last_name, SUM(amount) AS 'total_amount'
 FROM customers
 LEFT JOIN orders
   ON orders.customer_id = customers.id
 GROUP BY customers.id;`

return
> `+------------+-----------+--------------+
| first_name | last_name | total_amount |
+------------+-----------+--------------+
| Boy        | George    |       135.49 |
| George     | Michael   |       813.17 |
| David      | Bowie     |         NULL |
| Blue       | Steele    |         NULL |
| Bette      | Davis     |       450.25 |
+------------+-----------+--------------+`

As you can see, in **INNER JOIN**, we weren't able to get *David & Bette* because they don't exist in BOTH table. <br>
Yet, in **LEFT JOIN**, even though they don't exist in *orders* table, we can still select them. <br>
And this can help us identify important information, like: *who should be given coupons* or *who should be considered as VIPs*, etc.

### - IFNULL()
Now, as we start using **LEFT JOIN**, we start running into `NULL` value. To handle `NULL`s, of course we can use **`CASE` statement** to assign what value do we want, but we can do it much faster with `IFNULL(<checking_value>, <assign_value>)`.
To use `IFNULL` we need to pass in two arguments: `<checking_value>` (the filed that we want to check) and `<assign_value>` (value that we want to assign if the `<checking_value>` **IS *NULL***).

*e.g.*

> `SELECT first_name, last_name,` **`IFNULL(SUM(amount), 0)`** `AS total_amount
 FROM customers
 LEFT JOIN orders
   ON orders.customer_id = customers.id
 GROUP BY customers.id;`

return
> `+------------+-----------+--------------+
| first_name | last_name | total_amount |
+------------+-----------+--------------+
| Boy        | George    |       135.49 |
| George     | Michael   |       813.17 |
| David      | Bowie     |         0.00 |
| Blue       | Steele    |         0.00 |
| Bette      | Davis     |       450.25 |
+------------+-----------+--------------+`

### - RIGHT JOIN
Use everthing from the right table, and join it with the left table for only things that are match the right table. (the same idea as `LEFT JOIN`, but switch the order of the tables.) <br>

In [3]:
Image(url='https://www.w3schools.com/sql/img_rightjoin.gif')

Unfortunately, because every *user(`customer_id`)* in *orders* table must exist in *customers* table (as `id`).

*e.g.*

Switching *orders* and *customers* using the previous example:
> `SELECT first_name, last_name, SUM(amount) AS 'total_amount'
 FROM orders
 RIGHT JOIN customers
   ON orders.customer_id = customers.id
 GROUP BY customers.id;`

return
> `+------------+-----------+--------------+
| first_name | last_name | total_amount |
+------------+-----------+--------------+
| Boy        | George    |       135.49 |
| George     | Michael   |       813.17 |
| David      | Bowie     |         NULL |
| Blue       | Steele    |         NULL |
| Bette      | Davis     |       450.25 |
+------------+-----------+--------------+`

which is exactly the same

## Deleting data in related tables
Because of the foreign key constraint, when we delete some data that are interrelated, we will run into error.
Hence, to delete these data, you must first delete them from table that has the foreign key constraint (in our case – *orders* table), and then you can delete them from the the *customers* table.

On the order hand, if we lost some data, we might be able to recover certain values from other tables.

However, if we want to be allowed to delete data from parent table (*customers*) and we don't want to be deleting data every other children table (*orders*) we can use `ON DELETE CASCADE`.

### - ON DELETE CASCADE
To delete data not only from the parent table (*customers*), but children tables (*orders*) as well. To use it, we need to specify `ON DELETE CASCADE` while creating children tables and specifying foreign keys:

> `CREATE TABLE orders
(
	id INT AUTO_INCREMENT  PRIMARY KEY,
	order_date DATE,
	amount DECIMAL(8,2),
	customer_id INT,
	FOREIGN KEY(customer_id)
        REFERENCES customers(id)
        ON DELETE CASCADE
);`

### Exercises:

1. **Create these two new tables**

Students
- *id*
- *first_name*

Papers
- *title*
- *grade*
- *student_id*

>`CREATE TABLE students
(
 id INT AUTO_INCREMENT PRIMARY KEY,
 first_name VARCHAR(100)
);`

>` CREATE TABLE papers
(
 title VARCHAR(100),
 grade DECIMAL(5,2),
 student_id INT,
 FOREIGN KEY(student_id)
     REFERENCES students(id)
     ON DELETE CASCADE
);`

Insert some data:
>`INSERT INTO students (first_name) VALUES 
('Caleb'), ('Samantha'), ('Raj'), ('Carlos'), ('Lisa');`

> `INSERT INTO papers (student_id, title, grade ) VALUES
(1, 'My First Book Report', 60),
(1, 'My Second Book Report', 75),
(2, 'Russian Lit Through The Ages', 94),
(2, 'De Montaigne and The Art of The Essay', 98),
(4, 'Borges and Magical Realism', 89);`


2. **Print first_name, title, grade**

> `SELECT first_name, title, grade
FROM students
INNER JOIN papers
    ON papers.student_id = students.id
ORDER BY grade DESC;`

3. **Print first_name, title, grade with NULLs**

> `SELECT first_name, title, grade
FROM students
LEFT JOIN papers
    ON papers.student_id = students.id
ORDER BY grade DESC;`

4. **Print first_name, title, grade with missing title = 'MISSING' and missing grade = 0**

> `SELECT first_name,
          IFNULL(title, 'MISSING') AS title,
          IFNULL(grade, 0) AS grade
FROM students
LEFT JOIN papers
    ON papers.student_id = students.id
ORDER BY grade DESC;`

5. **Print student's names and their average grade**

> `SELECT first_name, IFNULL(AVG(grade),0) AS average
FROM students
LEFT JOIN papers
    ON papers.student_id = students.id
GROUP BY students.id
ORDER BY average DESC;`

6. **Print student's names, their average grade and if they pass (average grade >= 75)** <br>

> `SELECT first_name,
    IFNULL(AVG(grade),0) AS average,
    CASE
        WHEN IFNULL(AVG(grade),0) >= 75 THEN 'PASSING'
        ELSE 'FAILING'
    END AS 'passing_status'
FROM students
LEFT JOIN papers
    ON papers.student_id = students.id
GROUP BY students.id
ORDER BY average DESC;`

<br><br>

# Chapter 12 : Work with Multiple Tables - Many To Many
Tables that are interrelated, but not exclusive to each other.<br>
*e.g.* One tv series can have many reviews written by many reviewers, and one reviewer can write many reviews on many tv series.

**Schema**

*Reviewers*
 - id
 - first_name
 - last_name

*Series*
 - id
 - title
 - released_year
 - genre

*Reviews*
 - id
 - rating (*9.9 is the highest*)
 - reviewer_id
 - series_id

-- Create the tables

> `CREATE TABLE reviewers(
 id INT AUTO_INCREMENT PRIMARY KEY,
 first_name VARCHAR(100),
 last_name VARCHAR(100)
)`

> `CREATE TABLE series(
 id INT AUTO_INCREMENT PRIMARY KEY,
 title VARCHAR(255),
 released_year YEAR(4),
 genre VARCHAR(100)
);`

> `CREATE TABLE reviews(
 id INT AUTO_INCREMENT PRIMARY KEY,
 rating DECIMAL(3,1),
 reviewer_id INT,
 series_id INT,
 FOREIGN KEY(reviewer_id) REFERENCES reviewers(id),
 FOREIGN KEY(series_id) REFERENCES series(id)
);`

-- Insert some data:

> `INSERT INTO reviewers (first_name, last_name) VALUES
    ('Thomas', 'Stoneman'),
    ('Wyatt', 'Skaggs'),
    ('Kimbra', 'Masters'),
    ('Domingo', 'Cortes'),
    ('Colt', 'Steele'),
    ('Pinkie', 'Petit'),
    ('Marlon', 'Crafford');`

> `INSERT INTO series (title, released_year, genre) VALUES
    ('Archer', 2009, 'Animation'),
    ('Arrested Development', 2003, 'Comedy'),
    ("Bob's Burgers", 2011, 'Animation'),
    ('Bojack Horseman', 2014, 'Animation'),
    ("Breaking Bad", 2008, 'Drama'),
    ('Curb Your Enthusiasm', 2000, 'Comedy'),
    ("Fargo", 2014, 'Drama'),
    ('Freaks and Geeks', 1999, 'Comedy'),
    ('General Hospital', 1963, 'Drama'),
    ('Halt and Catch Fire', 2014, 'Drama'),
    ('Malcolm In The Middle', 2000, 'Comedy'),
    ('Pushing Daisies', 2007, 'Comedy'),
    ('Seinfeld', 1989, 'Comedy'),
    ('Stranger Things', 2016, 'Drama');`

> `INSERT INTO reviews(series_id, reviewer_id, rating) VALUES
    (1,1,8.0),(1,2,7.5),(1,3,8.5),(1,4,7.7),(1,5,8.9),
    (2,1,8.1),(2,4,6.0),(2,3,8.0),(2,6,8.4),(2,5,9.9),
    (3,1,7.0),(3,6,7.5),(3,4,8.0),(3,3,7.1),(3,5,8.0),
    (4,1,7.5),(4,3,7.8),(4,4,8.3),(4,2,7.6),(4,5,8.5),
    (5,1,9.5),(5,3,9.0),(5,4,9.1),(5,2,9.3),(5,5,9.9),
    (6,2,6.5),(6,3,7.8),(6,4,8.8),(6,2,8.4),(6,5,9.1),
    (7,2,9.1),(7,5,9.7),
    (8,4,8.5),(8,2,7.8),(8,6,8.8),(8,5,9.3),
    (9,2,5.5),(9,3,6.8),(9,4,5.8),(9,6,4.3),(9,5,4.5),
    (10,5,9.9),
    (13,3,8.0),(13,4,7.2),
    (14,2,8.5),(14,3,8.9),(14,4,8.9);`

### Exercises

1. Get titles and their ratings (no NULL):

> `SELECT 
  title,
  rating
FROM series
INNER JOIN reviews
 ON series.id = reviews.series_id;`

2. Get the average rating of each titles (no NULL):

> `SELECT 
  title,
  AVG(rating) AS 'avg_rating'
FROM series
INNER JOIN reviews
  ON series.id = reviews.series_id
GROUP BY series.id
ORDER BY avg_rating;`

3. Get every reviewers and their rating (no NULL):
> `SELECT 
  first_name, 
  last_name, 
  rating
FROM reviewers
INNER JOIN reviews
  ON reviews.reviewer_id = reviewers.id;`

-- appendex

> `SELECT 
  first_name, 
  last_name, 
  AVG(rating) AS 'avg_rating'
FROM reviewers
INNER JOIN reviews
  ON reviews.reviewer_id = reviewers.id
GROUP BY reviewers.id
ORDER BY avg_rating;`

(adding stadard deviation)

> `SELECT 
  first_name, 
  last_name, 
  AVG(rating) AS 'avg_rating',
  STDDEV(rating) AS 'std_rating'
FROM reviewers
INNER JOIN reviews
  ON reviews.reviewer_id = reviewers.id
GROUP BY reviewers.id
ORDER BY avg_rating;`

4. Find unreviewed series
> `SELECT
 title AS 'unreviewed series'
FROM series
LEFT JOIN reviews
  ON series.id = reviews.series_id
WHERE rating IS NULL;`

5. Find average rating of each genre
> `SELECT
  genre,
  ROUND(AVG(rating),2) AS 'avg_rating'
FROM series
INNER JOIN reviews
  ON reviews.series_id = series.id
GROUP BY series.genre;`

### - ROUND()
Use `ROUND(<value>, <number_of_digits>)` to specify how many digits do you want to show in the result.

6. Analytics on reviewers *(first name, last name, count, min, max, avg, status(avtice/inactive = (count=0)))*

> `SELECT
  first_name,
  last_name,
  COUNT(reviews.id) AS 'COUNT',
  IFNULL(MIN(rating),0) AS 'MIN',
  IFNULL(MAX(rating),0) AS 'MAX',
  IFNULL(AVG(rating),0) AS 'AVG',
  CASE
    WHEN COUNT(reviews.id) = 0 THEN 'INACTIVE'
    ELSE 'ACTIVE'
  END AS 'status'
FROM reviewers
LEFT JOIN reviews
  ON reviewers.id = reviews.reviewer_id
GROUP BY reviewers.id;`

### - IF()
Use `IF(<condition>, <value_if_TRUE>, <value_if_FALSE>)` to work with conditional logic with only TWO output. <br>
It is basically a **simplified version of `CASE` statement.**

*e.g.*

replace `CASE` statement with `IF` statement:
> `SELECT
  first_name,
  last_name,
  COUNT(reviews.id) AS 'COUNT',
  IFNULL(MIN(rating),0) AS 'MIN',
  IFNULL(MAX(rating),0) AS 'MAX',
  IFNULL(AVG(rating),0) AS 'AVG',
  IF(COUNT(reviews.id) = 0, 'INACTIVE', 'ACTIVE') AS 'status'
FROM reviewers
LEFT JOIN reviews
  ON reviewers.id = reviews.reviewer_id
GROUP BY reviewers.id;`

7. Print series title, rating and reviewer's name of each review.

> `SELECT
  title,
  rating, 
  CONCAT(first_name, ' ' , last_name) AS 'Reviewer'
FROM reviews
INNER JOIN reviewers
  ON reviews.reviewer_id = reviewers.id
INNER JOIN series
  ON reviews.series_id = series.id
ORDER BY title;`